-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Янв 18 2022 г., 10:24
-- Версия сервера: 10.3.29-MariaDB
-- Версия PHP: 7.2.34

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `cms`
--

-- --------------------------------------------------------

--
-- Структура таблицы `news`
--

CREATE TABLE `news` (
  `id` int(11) NOT NULL,
  `title` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `short_text` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `datetime` datetime NOT NULL,
  `datetime_lastedit` datetime DEFAULT NULL,
  `user_id` int(11) NOT NULL,
  `text` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `photo` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='Новини';

--
-- Дамп данных таблицы `news`
--

INSERT INTO `news` (`id`, `title`, `short_text`, `datetime`, `datetime_lastedit`, `user_id`, `text`, `photo`) VALUES
(29, 'У Львові поліцейські повідомили про підозру директорці підприємства', '<p>У Львові поліцейські повідомили про підозру директорці підприємства, яка привласнила майже півтора мільйона гривень державних коштів на ремонті вулиці. Про це повідомили у відділі комунікації Нацполіції Львівщини.</p>', '2022-01-17 13:45:15', '2022-01-17 14:32:47', 15, '<p>У Львові поліцейські повідомили про підозру директорці підприємства, яка привласнила майже півтора мільйона гривень державних коштів на ремонті вулиці. Про це <a href=\"https://portal.lviv.ua/\">Львівському порталу</a> повідомили у відділі комунікації Нацполіції Львівщини.</p><p>У Львові поліцейські повідомили про підозру директорці підприємства, яка привласнила майже півтора мільйона гривень державних коштів на ремонті вулиці. Про це <a href=\"https://portal.lviv.ua/\">Львівському порталу</a> повідомили у відділі комунікації Нацполіції Львівщини.</p><p>У Львові поліцейські повідомили про підозру директорці підприємства, яка привласнила майже півтора мільйона гривень державних коштів на ремонті вулиці. Про це <a href=\"https://portal.lviv.ua/\">Львівському порталу</a> повідомили у відділі комунікації Нацполіції Львівщини.У Львові поліцейські повідомили про підозру директорці підприємства, яка привласнила майже півтора мільйона гривень державних коштів на ремонті вулиці. Про це <a href=\"https://portal.lviv.ua/\">Львівському порталу</a> повідомили у відділі комунікації Нацполіції Львівщини.У Львові поліцейські повідомили про підозру директорці підприємства, яка привласнила майже півтора мільйона гривень державних коштів на ремонті вулиці. Про це <a href=\"https://portal.lviv.ua/\">Львівському порталу</a> повідомили у відділі комунікації Нацполіції Львівщини.</p><p>У Львові поліцейські повідомили про підозру директорці підприємства, яка привласнила майже півтора мільйона гривень державних коштів на ремонті вулиці. Про це <a href=\"https://portal.lviv.ua/\">Львівському порталу</a> повідомили у відділі комунікації Нацполіції Львівщини.</p><p>У Львові поліцейські повідомили про підозру директорці підприємства, яка привласнила майже півтора мільйона гривень державних коштів на ремонті вулиці. Про це <a href=\"https://portal.lviv.ua/\">Львівському порталу</a> повідомили у відділі комунікації Нацполіції Львівщини.</p><p>У Львові поліцейські повідомили про підозру директорці підприємства, яка привласнила майже півтора мільйона гривень державних коштів на ремонті вулиці. Про це <a href=\"https://portal.lviv.ua/\">Львівському порталу</a> повідомили у відділі комунікації Нацполіції Львівщини.У Львові поліцейські повідомили про підозру директорці підприємства, яка привласнила майже півтора мільйона гривень державних коштів на ремонті вулиці. Про це <a href=\"https://portal.lviv.ua/\">Львівському порталу</a> повідомили у відділі комунікації Нацполіції Львівщини.У Львові поліцейські повідомили про підозру директорці підприємства, яка привласнила майже півтора мільйона гривень державних коштів на ремонті вулиці. Про це <a href=\"https://portal.lviv.ua/\">Львівському порталу</a> повідомили у відділі комунікації Нацполіції Львівщини.</p>', '_61e553df55819'),
(32, 'У Порошенка намагалися відібрати паспорт?', '<p>У ході перетину державного кордону п’ятим Президентом України Петром Порошенком прикордонники чітко дотримувалися норм законодавства.</p>', '2022-01-17 14:20:39', '2022-01-17 14:21:52', 15, '<p>Держприкордонслужба повідомила, що під час проходження держкордону Порошенком відбувалися маніпуляції від окремих осіб, що, начебто, дану особу намагаються не пропустити в Україну.</p><p>«Кожна особа проходить визначені заходи прикордонного контролю, які тривають необхідну кількість часу… Петро Порошенко був оформлений у прикордонному відношенні на в’їзд в Україну», – йдеться у повідомленні.</p><p>Окрім того, під час заходів контролю про прибуття Петра Порошенка в Україну прикордонники повідомили представників правоохоронних органів, для «забезпечення розшуку осіб, які переховуються від органів досудового розслідування та суду, а також виконання в установленому порядку доручень правоохоронних органів».</p><p>Водночас <a href=\"https://www.pravda.com.ua/news/2022/01/17/7320615/\">Українська правда</a> повідомила, що коли Петро Порошенко прилетів до Києва, на митному контролі у нього забрали паспорт.</p>', '_61e55150018b5'),
(33, 'За рік Львівщина на третину збільшила експорт та імпорт товарів', '<p>Впродовж 2021 року експорт товарів із Львівщини становив 2668,5 млн дол. США, натомість імпорт – 4206,8 млн дол. У порівнянні з минулим роком, експорт зріс на 27,3%, а імпорт – на 35,1%. Про це порталу повідомили у Головному управлінні статистики Львівської області.</p>', '2022-01-17 14:33:59', '2022-01-17 14:37:59', 15, '<p>Впродовж 2021 року експорт товарів із Львівщини становив 2668,5 млн дол. США, натомість імпорт – 4206,8 млн дол. У порівнянні з минулим роком, експорт зріс на 27,3%, а імпорт – на 35,1%. Про це <a href=\"https://portal.lviv.ua/\">Львівському порталу</a> повідомили у Головному управлінні статистики Львівської області. Як зазначають у відомстві, Львівщина торгувала з 171 країною світу, нацбльше з Польщею – 26,0%, Німеччиною – 12,2%, Чехією – 7,0% та Данією – 6,6%. Серед товарів, які найчастіше вивозили з області переважають електроніка – 18,0%, меблі – 14,5%, зернові культури – 11,1%, вироби із деревини – 9,5%, олія та жири – 8,4%, а також нафта і продукти її перегонки – 6,6%.</p><p>Натомість, найбільша&nbsp; частка імпорту припадала на Польщу – 18, 9%, Китай – 12,0%, Білорусь – 11,5% та Німеччину – 10,1%. Найбільше з області ввозили нафту та її продукти – 17,3%, електроніку – 7,9%, а також пластмаси та полімерні матеріали – 6,1%. Зазначимо, що частка імпорту товарів з країн Європейського Союзу становила – 2231,0 млн дол. (53,0%), тобто зросла на 23,8%, а експорту – 2065,2 млн дол. (77,4%), що також збільшилась на 28,2%.</p>', '_61e5545eb7c08'),
(34, 'У ДБР кажуть, що в аеропорту намагалися вручити Порошенку повістку в суд', '<p>У Державному бюро розслідувань пояснили, що в аеропорту намагалися вручити процесуальні документи п’ятому президенту України Петру Порошенку, але той відмовився їх узяти. Про це повідомила радник з комунікацій ДБР Тетяна Сапьян на брифінгу 17 січня, відповідаючи на запитання журналістів, пише Українська правда.</p>', '2022-01-17 14:36:29', '2022-01-17 14:37:46', 15, '<p>У Державному бюро розслідувань пояснили, що в аеропорту намагалися вручити процесуальні документи п’ятому президенту України Петру Порошенку, але той відмовився їх узяти. Про це повідомила радник з комунікацій ДБР Тетяна Сапьян на брифінгу 17 січня, відповідаючи на запитання журналістів, пише <a href=\"https://www.pravda.com.ua/news/2022/01/17/7320628/\">Українська правда.</a></p><p>«Співробітники ДБР намагалися вручити процесуальні документи, а саме повістку в суд», – повідомила вона.</p><p>За словами Сапьян, Порошенко відмовився від їх отримання. У ДБР також стверджують, що особи, які супроводжували політика, чинили опір правоохоронцям. Сапьян каже, що захисники Порошенка сказали, що отримають документи після проходження паспортного контролю, але потім «штучно створили штовханину і втекли».</p><p>Відповідаючи на уточнююче запитання, чи можливе затримання Порошенка, комунікатор ДБР запевнила, що «сила – це останнє що буде залучатися до цього процесу».</p><p>Раніше повідомлялось, що у Петра Порошенка намагалися <a href=\"https://portal.lviv.ua/news/2022/01/17/u-poroshenka-namahalysia-vidibraty-pasport\">відібрати паспорт.</a> Його під аеропортом зустрічали <a href=\"https://portal.lviv.ua/news/2022/01/17/poroshenka-pid-aeroportom-zustrichaly-tysiachi-prykhylnykiv\">тисячі прихильників</a>.</p>', '_61e554c89ba23'),
(35, 'У Комарному під колесами авто загинув 32-річний пішохід', '<p>Аварія сталась близько 00:05 год. 17 січня в місті Комарно Львівського району.</p>', '2022-01-17 14:38:45', '2022-01-17 14:39:21', 15, '<p>Вночі 17 січня в місті Комарно на Львівщині водій автомобіля Dacia Logan збив 32-річного чоловіка. Від отриманих травм пішохід загинув на місці аварії. Про це <a href=\"https://portal.lviv.ua/\">Львівському порталу</a> повідомили в депатаметі цивільного захисту населення Львівської ОДА.</p><p>Аварія сталась близько 00:05 год. 17 січня в місті Комарно Львівського району.</p><p>41-річний мешканець села Чуловичі, керуючи автомобілем Dacia Logan, насмерть збив пішохода. Загиблим виявився 32-річний мешканець села Катериничі Львівсього району.</p><p>Обставини події встановлюються.</p>', '_61e5556967210'),
(36, 'Вбили 5 років тому: львів’янина Тараса Познякова поховають цього тижня', '<p>Водія BlaBlaCar, львів’янина Тараса Познякова, вбитого попутниками у 2016 році, поховають у Дніпрі 21-го січня. Про це у&nbsp;Фейсбук&nbsp;повідомила його мати Ольга Король.</p>', '2022-01-17 14:41:04', '2022-01-17 14:41:22', 15, '<p>Водія BlaBlaCar, львів’янина Тараса Познякова, вбитого попутниками у 2016 році, поховають у Дніпрі 21-го січня. Про це у&nbsp;Фейсбук&nbsp;повідомила його мати Ольга Король.</p><p>Правоохоронні органи закінчили всі потрібні експертизи та дозволили батькам поховати тіло сина.</p><p>«Не можу написати «відбудеться прощання з Тарасиком», адже він завжди поруч з нами, з&nbsp; його турботою, з&nbsp; його оптимізмом, широкою посмішкою та відкритою душею. Так&nbsp; було раніше, так є сьогодні та так буде завжди», – написала мама Познякова.</p><p>Відспівування Тараса Познякова відбудеться 20 січня у Києві у Свято-Михайлівському соборі, Варваринському приділі о 13:00. Поховають львів’янина у Дніпрі. Чин похорону відбудеться у четвер, 21 січня, об 11:00.</p><p>Нагадаємо, 25-річний&nbsp;<a href=\"https://portal.lviv.ua/news/2016/04/08/trivayut-poshuki-molodogo-lviv-yanina-shho-znik-iz-poputnikami-z-blablacar?fbclid=IwAR2y1SY7BtKjz5ebmxyrvv1IqQO8ihWv8qgRtCyatfxsWIluz_yWfLSDXVM\">львів’янин</a>&nbsp;Тарас Позняков у квітні 2016 року виїхав зі Львова до Києва приватним транспортом із попутниками з BlaBlaCar. Потім зв’язок з ним обірвався. Через тиждень поліція знайшла автомобіль Тараса в одному з гаражів Києво-Святошинського району.</p><p>Згодом правоохоронці оголосили&nbsp;<a href=\"https://portal.lviv.ua/news/2016/05/06/politsiya-rozshukuye-dvoh-pidozryuvanih-u-vbivstvi-tarasa-poznyakova-foto?fbclid=IwAR0iI9-H_QgaQAdwyphAiTTtPnp53GUc3ie7Mhelmw0_ZxzR8PCdHj-T9CM\">розшук</a>&nbsp;підозрюваних у вбивстві Познякова осіб – Дмитра Голуба та Луана Кінгісеппа.</p><p>У серпні 2016 року заарештували першого&nbsp;<a href=\"https://portal.lviv.ua/news/2016/08/05/politsiya-zatrimala-pidozryuvanogo-u-vbivstvi-lviv-yanina-tarasa-pozdnyakova?fbclid=IwAR1G1tlkFUjx-yXp9v98Cru9HCmEX7NsFJ5Jy3kqMHxWbc_uxjLUpISMn0k\">підозрюваного</a>&nbsp;у смерті Тараса – ексбійця «Правого сектора» Дмитра Голуба. Інший підозрюваний громадянин Російської Федерації Луан Кінгісепп загинув у 2019 році внаслідок вибуху в київській квартирі.</p><p>У травні 2019 року суд визнав винним Дмитра Голуба у вбивстві львів’янина та засудив його до&nbsp;<a href=\"https://portal.lviv.ua/news/2019/05/28/vbyvtsya-tarasa-poznyakova-otrymav-dovichne-uv-yaznennya?fbclid=IwAR3Ry5NYujhgIkdKKZV-IvBXQg-2bhUvq1YBbxneRtzjyJZnMV7qY9Caxs0\">довічного</a>&nbsp;ув’язнення.</p><p>Тіло Тараса Познякова вдалося&nbsp;<a href=\"https://portal.lviv.ua/news/2021/12/09/sbu-znajshla-tilo-vbytoho-lviv-ianyna-tarasa-pozniakova?fbclid=IwAR0od8pftOhkudVnJorm6fT9Yy_yqn-px7ZLSkToN32U31zpd_IFsGmKh5w\">знайти</a>&nbsp;тільки у грудні 2021 року поблизу траси «Житомир – Київ».</p>', '_61e555e219b57');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `login` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL,
  `password` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `access` int(11) DEFAULT NULL,
  `lastname` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `firstname` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `login`, `password`, `access`, `lastname`, `firstname`) VALUES
(15, 'test@1', '220466675e31b9d20c051d5e57974150', 0, 'admin', 'admin'),
(16, 'sobaka@1', '25d55ad283aa400af464c76d713c07ad', 0, 'Савченко', 'Данило');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `news`
--
ALTER TABLE `news`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=37;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
